RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6300/ip/hpm_spi_regs.h
/*
 * OVERRUN (RW)
 *
 * Data overrun occurs in the last transaction
 */
#define SPI_SLVST_OVERRUN_MASK (0x20000UL)
#define SPI_SLVST_OVERRUN_SHIFT (17U)
#define SPI_SLVST_OVERRUN_SET(x) (((uint32_t)(x) << SPI_SLVST_OVERRUN_SHIFT) & SPI_SLVST_OVERRUN_MASK)
#define SPI_SLVST_OVERRUN_GET(x) (((uint32_t)(x) & SPI_SLVST_OVERRUN_MASK) >> SPI_SLVST_OVERRUN_SHIFT)

/*
 * READY (RW)
 *
 * Set this bit to indicate that the ATCSPI200 is ready for data transaction.
 * When an SPI transaction other than slave status-reading command ends, this bit will be cleared to 0.
 */
#define SPI_SLVST_READY_MASK (0x10000UL)
#define SPI_SLVST_READY_SHIFT (16U)
#define SPI_SLVST_READY_SET(x) (((uint32_t)(x) << SPI_SLVST_READY_SHIFT) & SPI_SLVST_READY_MASK)
#define SPI_SLVST_READY_GET(x) (((uint32_t)(x) & SPI_SLVST_READY_MASK) >> SPI_SLVST_READY_SHIFT)

/*
 * USR_STATUS (RW)
 *
 * User defined status flags
 */
#define SPI_SLVST_USR_STATUS_MASK (0xFFFFU)
#define SPI_SLVST_USR_STATUS_SHIFT (0U)
#define SPI_SLVST_USR_STATUS_SET(x) (((uint32_t)(x) << SPI_SLVST_USR_STATUS_SHIFT) & SPI_SLVST_USR_STATUS_MASK)
#define SPI_SLVST_USR_STATUS_GET(x) (((uint32_t)(x) & SPI_SLVST_USR_STATUS_MASK) >> SPI_SLVST_USR_STATUS_SHIFT)

/* Bitfield definition for register: SLVDATACNT */
/*
 * WCNT (RO)
 *
 * Slave transmitted data count
 */
#define SPI_SLVDATACNT_WCNT_MASK (0x3FF0000UL)
#define SPI_SLVDATACNT_WCNT_SHIFT (16U)
#define SPI_SLVDATACNT_WCNT_GET(x) (((uint32_t)(x) & SPI_SLVDATACNT_WCNT_MASK) >> SPI_SLVDATACNT_WCNT_SHIFT)

/*
 * RCNT (RO)
 *
 * Slave received data count
 */
#define SPI_SLVDATACNT_RCNT_MASK (0x3FFU)
#define SPI_SLVDATACNT_RCNT_SHIFT (0U)
#define SPI_SLVDATACNT_RCNT_GET(x) (((uint32_t)(x) & SPI_SLVDATACNT_RCNT_MASK) >> SPI_SLVDATACNT_RCNT_SHIFT)

/* Bitfield definition for register: CONFIG */
/*
 * SLAVE (RO)
 *
 * Support for SPI Slave mode
 */
#define SPI_CONFIG_SLAVE_MASK (0x4000U)
#define SPI_CONFIG_SLAVE_SHIFT (14U)
#define SPI_CONFIG_SLAVE_GET(x) (((uint32_t)(x) & SPI_CONFIG_SLAVE_MASK) >> SPI_CONFIG_SLAVE_SHIFT)

/*
 * QUADSPI (RO)
 *
 * Support for Quad I/O SPI
 */
#define SPI_CONFIG_QUADSPI_MASK (0x200U)
#define SPI_CONFIG_QUADSPI_SHIFT (9U)
#define SPI_CONFIG_QUADSPI_GET(x) (((uint32_t)(x) & SPI_CONFIG_QUADSPI_MASK) >> SPI_CONFIG_QUADSPI_SHIFT)

/*
 * DUALSPI (RO)
 *
 * Support for Dual I/O SPI
 */
#define SPI_CONFIG_DUALSPI_MASK (0x100U)
#define SPI_CONFIG_DUALSPI_SHIFT (8U)
#define SPI_CONFIG_DUALSPI_GET(x) (((uint32_t)(x) & SPI_CONFIG_DUALSPI_MASK) >> SPI_CONFIG_DUALSPI_SHIFT)

/*
 * TXFIFOSIZE (RO)
 *
 * Depth of TX FIFO
 * 0x0: 2 words
 * 0x1: 4 words
 * 0x2: 8 words
 * 0x3: 16 words
 * 0x4: 32 words
 * 0x5: 64 words
 * 0x6: 128 words
 */
#define SPI_CONFIG_TXFIFOSIZE_MASK (0xF0U)
#define SPI_CONFIG_TXFIFOSIZE_SHIFT (4U)
#define SPI_CONFIG_TXFIFOSIZE_GET(x) (((uint32_t)(x) & SPI_CONFIG_TXFIFOSIZE_MASK) >> SPI_CONFIG_TXFIFOSIZE_SHIFT)

/*
 * RXFIFOSIZE (RO)
 *
 * Depth of RX FIFO
 * 0x0: 2 words
 * 0x1: 4 words
 * 0x2: 8 words
 * 0x3: 16 words
 * 0x4: 32 words
 * 0x5: 64 words
 * 0x6: 128 words
 */
#define SPI_CONFIG_RXFIFOSIZE_MASK (0xFU)
#define SPI_CONFIG_RXFIFOSIZE_SHIFT (0U)
#define SPI_CONFIG_RXFIFOSIZE_GET(x) (((uint32_t)(x) & SPI_CONFIG_RXFIFOSIZE_MASK) >> SPI_CONFIG_RXFIFOSIZE_SHIFT)




#endif /* HPM_SPI_H */
